renbers/Personal-embedded-projects-portfolio/ball-machine/HT32    Control/utilities/middleware/i2c_master.c
/*********************************************************************************************************//**
 * @file    i2c_master.c
 * @version $Rev:: 1260         $
 * @date    $Date:: 2024-06-25 #$
 * @brief   The I2C Master (interrupt mode with buffer).
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32.h"
#include "i2c_master.h"


/** @addtogroup HT32_Series_Peripheral_Examples HT32 Peripheral Examples
  * @{
  */

/** @addtogroup I2C I2C
  * @{
  */

/** @addtogroup I2C_Master I2C Master
  * @{
  */


/* Private types -------------------------------------------------------------------------------------------*/
/**
 * @brief I2C Master state variables
 */
typedef struct
{
  HT_I2C_TypeDef *pI2Cx;
  u32 uTxIndex;
  u32 uTxLength;
  u8 *puTxBuffer;

  u32 uRxIndex;
  u32 uRxLength;
  u8 *puRxBuffer;

  u32 uSlaveAddress;
  I2CMaster_CMD_Enum Command;
  u32 uI2CReadWrite;
  vu32 IsBusy;
  vu32 uIsNACK;
  vu32 uIsBusError;
  vu32 uIsHardwareTimeout;
  vu32 uStart;
  vs32 sTimerCount;
  vs32 sDynamicOnOffI2C;
} I2CMaster_StateTypeDef;

/* Private constants ---------------------------------------------------------------------------------------*/
#ifdef HTCFG_I2CM_CH0
#define _SCL0_GPIO_ID            STRCAT2(GPIO_P,    HTCFG_M0_SCL_GPIO_PORT)
#define _SCL0_AFIO_PIN           STRCAT2(AFIO_PIN_, HTCFG_M0_SCL_GPIO_PIN)
#define _SDA0_GPIO_ID            STRCAT2(GPIO_P,    HTCFG_M0_SDA_GPIO_PORT)
#define _SDA0_AFIO_PIN           STRCAT2(AFIO_PIN_, HTCFG_M0_SDA_GPIO_PIN)
#define _I2C_CH0                 STRCAT2(HT_,       HTCFG_I2CM_CH0)  /* I2C channel                         */
#define _I2C_INT0                STRCAT2(HTCFG_I2CM_CH0, _IRQn)      /* I2C interrupt channel of NVIC       */
  #if I2C_MASTER_INITIAL_BUS
  #define _SCL0_GPIO_CLK         STRCAT2(P,          HTCFG_M0_SCL_GPIO_PORT)
  #define _SCL0_GPIO             STRCAT2(HT_GPIO,    HTCFG_M0_SCL_GPIO_PORT)
  #endif
#endif

#ifdef HTCFG_I2CM_CH1
#define _SCL1_GPIO_ID            STRCAT2(GPIO_P,    HTCFG_M1_SCL_GPIO_PORT)
#define _SCL1_AFIO_PIN           STRCAT2(AFIO_PIN_, HTCFG_M1_SCL_GPIO_PIN)
#define _SDA1_GPIO_ID            STRCAT2(GPIO_P,    HTCFG_M1_SDA_GPIO_PORT)
#define _SDA1_AFIO_PIN           STRCAT2(AFIO_PIN_, HTCFG_M1_SDA_GPIO_PIN)
#define _I2C_CH1                 STRCAT2(HT_, HTCFG_I2CM_CH1)       /* I2C channel                          */
#define _I2C_INT1                STRCAT2(HTCFG_I2CM_CH1, _IRQn)     /* I2C interrupt channel of NVIC        */
  #if I2C_MASTER_INITIAL_BUS
  #define _SCL1_GPIO_CLK         STRCAT2(P,          HTCFG_M1_SCL_GPIO_PORT)
  #define _SCL1_GPIO             STRCAT2(HT_GPIO,    HTCFG_M1_SCL_GPIO_PORT)
  #endif
#endif

#ifdef HTCFG_I2CM_CH2
#define _SCL2_GPIO_ID            STRCAT2(GPIO_P,    HTCFG_M2_SCL_GPIO_PORT)
#define _SCL2_AFIO_PIN           STRCAT2(AFIO_PIN_, HTCFG_M2_SCL_GPIO_PIN)
#define _SDA2_GPIO_ID            STRCAT2(GPIO_P,    HTCFG_M2_SDA_GPIO_PORT)
#define _SDA2_AFIO_PIN           STRCAT2(AFIO_PIN_, HTCFG_M2_SDA_GPIO_PIN)
#define _I2C_CH2                 STRCAT2(HT_, HTCFG_I2CM_CH2)       /* I2C channel                          */
#define _I2C_INT2                STRCAT2(HTCFG_I2CM_CH2, _IRQn)     /* I2C interrupt channel of NVIC        */
  #if I2C_MASTER_INITIAL_BUS
  #define _SCL2_GPIO_CLK         STRCAT2(P,          HTCFG_M2_SCL_GPIO_PORT)
  #define _SCL2_GPIO             STRCAT2(HT_GPIO,    HTCFG_M2_SCL_GPIO_PORT)
  #endif
#endif

#ifdef HTCFG_I2CM_CH3
#define _SCL3_GPIO_ID            STRCAT2(GPIO_P,    HTCFG_M3_SCL_GPIO_PORT)
#define _SCL3_AFIO_PIN           STRCAT2(AFIO_PIN_, HTCFG_M3_SCL_GPIO_PIN)
#define _SDA3_GPIO_ID            STRCAT2(GPIO_P,    HTCFG_M3_SDA_GPIO_PORT)
#define _SDA3_AFIO_PIN           STRCAT2(AFIO_PIN_, HTCFG_M3_SDA_GPIO_PIN)
#define _I2C_CH3                 STRCAT2(HT_, HTCFG_I2CM_CH3)       /* I2C channel                          */
#define _I2C_INT3                STRCAT2(HTCFG_I2CM_CH3, _IRQn)     /* I2C interrupt channel of NVIC        */
  #if I2C_MASTER_INITIAL_BUS
  #define _SCL3_GPIO_CLK         STRCAT2(P,          HTCFG_M3_SCL_GPIO_PORT)
  #define _SCL3_GPIO             STRCAT2(HT_GPIO,    HTCFG_M3_SCL_GPIO_PORT)
  #endif
#endif

#define I2C_MASTER_RECEIVED_TXNACK    ((u32)0x003A0200)
#define I2C_MASTER_RECEIVED_RXNACK    ((u32)0x00180200)

/* Private function prototypes -----------------------------------------------------------------------------*/
I2CMaster_Status_Enum _I2CMaster_DynamicTimeout(u32 CH);

/* Private macro -------------------------------------------------------------------------------------------*/
#define __DBG_Printf(...)

