renbers/Personal-embedded-projects-portfolio/ball-machine/HT32    Control/utilities/middleware/i2c_master.c
#if (I2C_MASTER_DEBUG_MODE == 1)
  #undef __DBG_Printf
  #define __DBG_Printf printf
  #warning "================================ Debug Mode Warning ===================================="
  #warning " Debug mode has been enable which degrade the performance.                              "
  #warning " After all debug operation is finished, please remember to turn off debug mode.         "
  #warning "========================================================================================"
#endif

/* Private variables ---------------------------------------------------------------------------------------*/
static I2CMaster_StateTypeDef gI2CMasterState[I2C_MASTER_SUPPORT_CH];

#if FREERTOS_I2C
SemaphoreHandle_t Semphr[I2C_MASTER_SUPPORT_CH];
StaticSemaphore_t Semphr_Buffer[I2C_MASTER_SUPPORT_CH];
SemaphoreHandle_t Mutex[I2C_MASTER_SUPPORT_CH];
StaticSemaphore_t Mutex_Buffer[I2C_MASTER_SUPPORT_CH];
u32 Transfer_Result[I2C_MASTER_SUPPORT_CH];
#endif

/* Global functions ----------------------------------------------------------------------------------------*/
/*********************************************************************************************************//**
 * @brief Initial I2C Master.
 * @param CH: I2C Channel
 * @param uMasterAddress
 * @param uClockSpeed
 * @retval None
 ************************************************************************************************************/
void I2CMaster_Init(u32 CH, u32 uMasterAddress, u32 uClockSpeed)
{
  /* !!! NOTICE !!!
     Notice that the local variable (structure) did not have an initial value.
     Please confirm that there are no missing members in the parameter settings below in this function.
  */
  I2C_InitTypeDef  I2C_InitStructure;
  CKCU_PeripClockConfig_TypeDef CKCUClock = {{ 0 }};
  I2CMaster_StateTypeDef *pI2CMasterState = &gI2CMasterState[CH];
  CKCUClock.Bit.AFIO       = 1;

  #ifdef HTCFG_I2CM_CH0
  if (CH == I2C_MASTER_CH0)
  {
    gI2CMasterState[I2C_MASTER_CH0].pI2Cx = _I2C_CH0;
    /* Enable I2C & AFIO APB clock                                                                          */
    CKCUClock.Bit.HTCFG_I2CM_CH0 = 1;
    CKCU_PeripClockConfig(CKCUClock, ENABLE);

    /* Send eight clocks                                                                                    */
    #if I2C_MASTER_INITIAL_BUS
    {
      volatile int i = 0;
      volatile int tm = 0;
      CKCUClock.Bit._SCL0_GPIO_CLK = 1;
      CKCU_PeripClockConfig(CKCUClock, ENABLE);
      AFIO_GPxConfig(_SCL0_GPIO_ID, _SCL0_AFIO_PIN, AFIO_FUN_GPIO);
      GPIO_SetOutBits(_SCL0_GPIO, _SCL0_AFIO_PIN);
      GPIO_DirectionConfig(_SCL0_GPIO, _SCL0_AFIO_PIN, GPIO_DIR_OUT);
      for (; i < 8; i++)
      {
        GPIO_ClearOutBits(_SCL0_GPIO, _SCL0_AFIO_PIN);
        for (tm = 0; tm < 2000; tm++)
        __NOP();
        GPIO_SetOutBits(_SCL0_GPIO, _SCL0_AFIO_PIN);
        for (tm = 0; tm < 2000; tm++)
        __NOP();
      }
    }
    #endif

    /* Configure AFIO as I2C mode                                                                           */
    AFIO_GPxConfig(_SCL0_GPIO_ID, _SCL0_AFIO_PIN, AFIO_FUN_I2C);
    AFIO_GPxConfig(_SDA0_GPIO_ID, _SDA0_AFIO_PIN, AFIO_FUN_I2C);

    NVIC_EnableIRQ(_I2C_INT0);
  }
  #endif

  #ifdef HTCFG_I2CM_CH1
  if (CH == I2C_MASTER_CH1)
  {
    gI2CMasterState[I2C_MASTER_CH1].pI2Cx = _I2C_CH1;
    CKCUClock.Bit.HTCFG_I2CM_CH1 = 1;
    CKCU_PeripClockConfig(CKCUClock, ENABLE);

    #if I2C_MASTER_INITIAL_BUS
    {
      volatile int i = 0;
      volatile int tm = 0;
      CKCUClock.Bit._SCL1_GPIO_CLK = 1;
      CKCU_PeripClockConfig(CKCUClock, ENABLE);
      AFIO_GPxConfig(_SCL1_GPIO_ID, _SCL1_AFIO_PIN, AFIO_FUN_GPIO);
      GPIO_SetOutBits(_SCL1_GPIO, _SCL1_AFIO_PIN);
      GPIO_DirectionConfig(_SCL1_GPIO, _SCL1_AFIO_PIN, GPIO_DIR_OUT);
      for (; i < 8; i++)
      {
        GPIO_ClearOutBits(_SCL1_GPIO, _SCL1_AFIO_PIN);
        for (tm = 0; tm < 2000; tm++)
        __NOP();
        GPIO_SetOutBits(_SCL1_GPIO, _SCL1_AFIO_PIN);
        for (tm = 0; tm < 2000; tm++)
        __NOP();
      }
    }
    #endif

    AFIO_GPxConfig(_SCL1_GPIO_ID, _SCL1_AFIO_PIN, AFIO_FUN_I2C);
    AFIO_GPxConfig(_SDA1_GPIO_ID, _SDA1_AFIO_PIN, AFIO_FUN_I2C);

    NVIC_EnableIRQ(_I2C_INT1);
  }
  #endif

  #ifdef HTCFG_I2CM_CH2
  if (CH == I2C_MASTER_CH2)
  {
    gI2CMasterState[I2C_MASTER_CH2].pI2Cx = _I2C_CH2;
    CKCUClock.Bit.HTCFG_I2CM_CH2 = 1;
    CKCU_PeripClockConfig(CKCUClock, ENABLE);

    #if I2C_MASTER_INITIAL_BUS
    {
      volatile int i = 0;
      volatile int tm = 0;
      CKCUClock.Bit._SCL2_GPIO_CLK = 1;
      CKCU_PeripClockConfig(CKCUClock, ENABLE);
      AFIO_GPxConfig(_SCL2_GPIO_ID, _SCL2_AFIO_PIN, AFIO_FUN_GPIO);
      GPIO_SetOutBits(_SCL2_GPIO, _SCL2_AFIO_PIN);
      GPIO_DirectionConfig(_SCL2_GPIO, _SCL2_AFIO_PIN, GPIO_DIR_OUT);
      for (; i < 8; i++)
      {
        GPIO_ClearOutBits(_SCL2_GPIO, _SCL2_AFIO_PIN);
        for (tm = 0; tm < 2000; tm++)
        __NOP();
        GPIO_SetOutBits(_SCL2_GPIO, _SCL2_AFIO_PIN);
        for (tm = 0; tm < 2000; tm++)
        __NOP();
      }
    }
    #endif

    AFIO_GPxConfig(_SCL2_GPIO_ID, _SCL2_AFIO_PIN, AFIO_FUN_I2C);
    AFIO_GPxConfig(_SDA2_GPIO_ID, _SDA2_AFIO_PIN, AFIO_FUN_I2C);

    NVIC_EnableIRQ(_I2C_INT2);
  }
  #endif

  #ifdef HTCFG_I2CM_CH3
  if (CH == I2C_MASTER_CH3)
  {
    gI2CMasterState[I2C_MASTER_CH3].pI2Cx = _I2C_CH3;
    CKCUClock.Bit.HTCFG_I2CM_CH3 = 1;
    CKCU_PeripClockConfig(CKCUClock, ENABLE);

    #if I2C_MASTER_INITIAL_BUS
    {
      volatile int i = 0;
      volatile int tm = 0;
      CKCUClock.Bit._SCL3_GPIO_CLK = 1;
      CKCU_PeripClockConfig(CKCUClock, ENABLE);
      AFIO_GPxConfig(_SCL3_GPIO_ID, _SCL3_AFIO_PIN, AFIO_FUN_GPIO);
      GPIO_SetOutBits(_SCL3_GPIO, _SCL3_AFIO_PIN);
      GPIO_DirectionConfig(_SCL3_GPIO, _SCL3_AFIO_PIN, GPIO_DIR_OUT);
      for (; i < 8; i++)
      {
        GPIO_ClearOutBits(_SCL3_GPIO, _SCL3_AFIO_PIN);
        for (tm = 0; tm < 2000; tm++)
        __NOP();
        GPIO_SetOutBits(_SCL3_GPIO, _SCL3_AFIO_PIN);
        for (tm = 0; tm < 2000; tm++)
        __NOP();
      }
    }
    #endif


