renbers/Personal-embedded-projects-portfolio/ball-machine/HT32    Control/utilities/middleware/i2c_master.c
    AFIO_GPxConfig(_SCL3_GPIO_ID, _SCL3_AFIO_PIN, AFIO_FUN_I2C);
    AFIO_GPxConfig(_SDA3_GPIO_ID, _SDA3_AFIO_PIN, AFIO_FUN_I2C);

    NVIC_EnableIRQ(_I2C_INT3);
  }
  #endif

  /* I2C configuration                                                                                      */
  I2C_InitStructure.I2C_GeneralCall = DISABLE;
  I2C_InitStructure.I2C_AddressingMode = I2C_ADDRESSING_7BIT;
  I2C_InitStructure.I2C_Acknowledge = DISABLE;
  I2C_InitStructure.I2C_OwnAddress = uMasterAddress;
  I2C_InitStructure.I2C_Speed = uClockSpeed;
  I2C_InitStructure.I2C_SpeedOffset = SystemCoreClock / 8000000;
  I2C_Init(pI2CMasterState->pI2Cx, &I2C_InitStructure);

  #if I2C_MASTER_HW_TIMEOUT_MODE
  /*Seting TimeOut Counter                                                                                  */
  I2C_SetTimeOutPrescaler(pI2CMasterState->pI2Cx, I2C_MASTER_HW_TIMEOUT_DIV << 16);
  I2C_SetTimeOutValue(pI2CMasterState->pI2Cx, I2C_MASTER_HW_TIMEOUT_BASE);

  /* Enable I2C                                                                                             */
  I2C_TimeOutCmd(pI2CMasterState->pI2Cx, ENABLE);
  I2C_IntConfig(pI2CMasterState->pI2Cx, I2C_INT_TOUT, ENABLE);
  #endif

  #if (LIBCFG_I2C_NO_ARBLOS == 0)
  /* Enable I2C interrupts                                                                                  */
  I2C_IntConfig(pI2CMasterState->pI2Cx, I2C_INT_ARBLOS | I2C_INT_BUSERR | I2C_INT_STA | I2C_INT_ADRS | I2C_INT_RXNACK | I2C_INT_RXDNE, ENABLE);
  #else
  /* Enable I2C interrupts                                                                                  */
  I2C_IntConfig(pI2CMasterState->pI2Cx, I2C_INT_BUSERR | I2C_INT_STA | I2C_INT_ADRS | I2C_INT_RXNACK | I2C_INT_RXDNE, ENABLE);
  #endif

  I2C_CombFilterCmd(pI2CMasterState->pI2Cx, ENABLE);
  I2C_SequentialFilterConfig(pI2CMasterState->pI2Cx, SEQ_FILTER_2_PCLK);
}

/*********************************************************************************************************//**
 * @brief I2C Write.
 * @param CH: I2C Channel
 * @param pI2CMaster:
 * @retval None
 ************************************************************************************************************/
void I2CMaster_Write(u32 CH, I2CMaster_Typedef *pI2CMaster)
{
  pI2CMaster->Command = I2C_MASTER_CMD_WRITE;
  I2CMaster_Start(CH, pI2CMaster);
}

/*********************************************************************************************************//**
 * @brief I2C Read.
 * @param CH: I2C Channel
 * @param pI2CMaster:
 * @retval None
 ************************************************************************************************************/
void I2CMaster_Read(u32 CH, I2CMaster_Typedef *pI2CMaster)
{
  pI2CMaster->Command = I2C_MASTER_CMD_READ;
  I2CMaster_Start(CH, pI2CMaster);
}

/*********************************************************************************************************//**
 * @brief I2C Write Read.
 * @param CH: I2C Channel
 * @param pI2CMaster:
 * @retval None
 ************************************************************************************************************/
void I2CMaster_WriteRead(u32 CH, I2CMaster_Typedef *pI2CMaster)
{
  pI2CMaster->Command = I2C_MASTER_CMD_WRITEREAD;
  I2CMaster_Start(CH, pI2CMaster);
}

/*********************************************************************************************************//**
 * @brief I2C Write Stop Read.
 * @param CH: I2C Channel
 * @param pI2CMaster:
 * @retval None
 ************************************************************************************************************/
void I2CMaster_WriteStopRead(u32 CH, I2CMaster_Typedef *pI2CMaster)
{
  pI2CMaster->Command = I2C_MASTER_CMD_WRITESTOPREAD;
  I2CMaster_Start(CH, pI2CMaster);
}

/*********************************************************************************************************//**
 * @brief Start Read or Write of I2C buffer.
 * @param CH: I2C Channel
 * @param pI2CMaster: Pointer of I2CMaster_InitTypedef
 * @retval None
  ***********************************************************************************************************/
void I2CMaster_Start(u32 CH, I2CMaster_Typedef *pI2CMaster)
{
  I2CMaster_StateTypeDef *pI2CMasterState = &gI2CMasterState[CH];

  pI2CMasterState->uTxIndex = 0;
  pI2CMasterState->uTxLength = pI2CMaster->Tx.uLength;
  pI2CMasterState->puTxBuffer = pI2CMaster->Tx.puBuffer;

  pI2CMasterState->uRxIndex = 0;
  pI2CMasterState->uRxLength = pI2CMaster->Rx.uLength;
  pI2CMasterState->puRxBuffer = pI2CMaster->Rx.puBuffer;

  pI2CMasterState->uSlaveAddress = pI2CMaster->uSlaveAddress;
  pI2CMasterState->Command = pI2CMaster->Command;

  pI2CMasterState->IsBusy = TRUE;
  pI2CMasterState->uIsNACK = FALSE;
  pI2CMasterState->uIsBusError = FALSE;
  pI2CMasterState->uIsHardwareTimeout = FALSE;

  #if (I2C_MASTER_SW_TIMEOUT_MODE!=0)
  pI2CMasterState->sTimerCount = TRANSFER_TIMER(pI2CMaster->uTimeout_us);
  if (pI2CMasterState->sTimerCount <= 0)
  {
    while(1);   //Please check uTimeout_us need more than I2C_MASTER_SW_TIMEOUT_BASE.
  }
  #endif

  /* this flag avoided I2C busbusy when Pull-up was disabled.                                               */
  pI2CMasterState->sDynamicOnOffI2C = (u32)pI2CMaster->isDynamicOnOff_I2C;

  I2C_Cmd(pI2CMasterState->pI2Cx, ENABLE);

  #if (I2C_MASTER_SW_TIMEOUT_MODE == 2)
  pI2CMasterState->uStart = I2CMASTER_GETTICK();
  #endif

  while (I2C_GetFlagStatus(pI2CMasterState->pI2Cx, I2C_FLAG_BUSBUSY) == SET)
  {
    #if (I2C_MASTER_SW_TIMEOUT_MODE == 2)
    u32 uCurrent = I2CMASTER_GETTICK();
    pI2CMasterState->sTimerCount -= DIFF_TICK(pI2CMasterState->uStart,uCurrent);
    pI2CMasterState->uStart = uCurrent;
    #endif

    if (pI2CMasterState->sTimerCount <= 0)
    {
      return;
    }
  }

  I2C_ClearFlag(pI2CMasterState->pI2Cx, I2C_FLAG_RXNACK);
  I2C_IntConfig(pI2CMasterState->pI2Cx, I2C_INT_RXNACK, ENABLE);

  if (pI2CMaster->Command == I2C_MASTER_CMD_WRITE ||
      pI2CMaster->Command == I2C_MASTER_CMD_WRITEREAD ||
      pI2CMaster->Command == I2C_MASTER_CMD_WRITESTOPREAD)
  {
    I2C_IntConfig(pI2CMasterState->pI2Cx, I2C_INT_TXDE, ENABLE);
    pI2CMasterState->uI2CReadWrite = I2C_MASTER_WRITE;
  }
  else
  {
    pI2CMasterState->uI2CReadWrite = I2C_MASTER_READ;
  }

  I2C_TargetAddressConfig(pI2CMasterState->pI2Cx, pI2CMasterState->uSlaveAddress, pI2CMasterState->uI2CReadWrite);

  return;
}

