renbers/Personal-embedded-projects-portfolio/ball-machine/HT32    Control/utilities/middleware/i2c_master.c
/*********************************************************************************************************//**
 * @brief Get I2C buffer status.
 * @param CH: I2C Channel
 * @retval Result: I2C_MASTER_FINISH, I2C_MASTER_HW_TIMEOUT or I2C_MASTER_SW_TIMEOUT
 ************************************************************************************************************/
I2CMaster_Status_Enum I2CMaster_GetStatus(u32 CH)
{
  I2CMaster_StateTypeDef *pI2CMasterState = &gI2CMasterState[CH];
  I2CMaster_Status_Enum Result = I2C_MASTER_GOING;
  #if (I2C_MASTER_NACK_AUTO_RETRY == 1)
  vu32 i;
  #endif

  #if (I2C_MASTER_SW_TIMEOUT_MODE == 2)
  u32 uCurrent;
  uCurrent = I2CMASTER_GETTICK();
  pI2CMasterState->sTimerCount -= DIFF_TICK(pI2CMasterState->uStart,uCurrent);
  pI2CMasterState->uStart = uCurrent;
  #endif

  if (pI2CMasterState->uIsBusError == TRUE)
  {
    return I2C_MASTER_BUSERR;
  }

  if (pI2CMasterState->uIsHardwareTimeout == TRUE)
  {
    return I2C_MASTER_HW_TIMEOUT;
  }

  if (pI2CMasterState->IsBusy == FALSE)
  {
    Result = I2C_MASTER_FINISH;
  }

  else if (pI2CMasterState->sTimerCount <= 0)
  {
    pI2CMasterState->IsBusy = FALSE;
    Result = I2C_MASTER_SW_TIMEOUT;

    I2C_IntConfig(pI2CMasterState->pI2Cx, I2C_INT_RXNACK, DISABLE);
    I2C_ClearFlag(pI2CMasterState->pI2Cx, I2C_FLAG_RXNACK);

    I2C_GenerateSTOP(pI2CMasterState->pI2Cx);
  }
  else if (pI2CMasterState->uIsNACK == TRUE)
  {
    pI2CMasterState->uIsNACK = FALSE;

    #if (I2C_MASTER_NACK_AUTO_RETRY == 0)
    Result = I2C_MASTER_NACK;
    #else
    /* Release I2C bus for other master by adding a delay                                                   */
    for (i = 0; i < 500; i++);

    /* Re-Write Slave address for start Tx or Rx (re-try when Slave not ack)                                */
    I2C_TargetAddressConfig(pI2CMasterState->pI2Cx, pI2CMasterState->uSlaveAddress, pI2CMasterState->uI2CReadWrite);
    #endif
  }

  return Result;
}

/*********************************************************************************************************//**
 * @brief Get I2C Rx index.
 * @param CH: I2C Channel
 * @retval None
 ************************************************************************************************************/
u32 I2CMaster_GetRxIndex(u32 CH)
{
  I2CMaster_StateTypeDef *pI2CMasterState = &gI2CMasterState[CH];
  return pI2CMasterState->uRxIndex;
}

/*********************************************************************************************************//**
 * @brief Update I2C Rx length.
 * @param CH: I2C Channel
 * @retval None
 ************************************************************************************************************/
void I2CMaster_UpdateRxLength(u32 CH, u32 uLength)
{
  I2CMaster_StateTypeDef *pI2CMasterState = &gI2CMasterState[CH];
  pI2CMasterState->uRxLength = uLength;
  return;
}

#if defined(I2C0_IRQ_HANDLER) || defined(I2C1_IRQ_HANDLER) || defined(I2C2_IRQ_HANDLER) || defined(I2C3_IRQ_HANDLER)
#if defined(HT_I2C0) && defined(I2C0_IRQ_HANDLER)
/*********************************************************************************************************//**
 * @brief This function handles I2C interrupt.
 * @retval None
 ************************************************************************************************************/
void I2C0_IRQHandler(void)
{
  I2C0_IRQ_HANDLER();
}
#endif
#if defined(HT_I2C1) && defined(I2C1_IRQ_HANDLER)
/*********************************************************************************************************//**
 * @brief This function handles I2C interrupt.
 * @retval None
 ************************************************************************************************************/
void I2C1_IRQHandler(void)
{
  I2C1_IRQ_HANDLER();
}
#endif
#if defined(HT_I2C2) && defined(I2C2_IRQ_HANDLER)
/*********************************************************************************************************//**
 * @brief This function handles I2C interrupt.
 * @retval None
 ************************************************************************************************************/
void I2C2_IRQHandler(void)
{
  I2C2_IRQ_HANDLER();
}
#endif
#if defined(HT_I2C3) && defined(I2C3_IRQ_HANDLER)
/*********************************************************************************************************//**
 * @brief This function handles I2C interrupt.
 * @retval None
 ************************************************************************************************************/
void I2C3_IRQHandler(void)
{
  I2C3_IRQ_HANDLER();
}
#endif
#else
#ifdef HTCFG_I2CM_CH0
/*********************************************************************************************************//**
 * @brief This function handles I2C interrupt.
 * @retval None
 ************************************************************************************************************/
void I2CM_CH0_IRQHandler(void)
{
  I2CMaster_IRQHandler(I2C_MASTER_CH0);
}
#endif

#ifdef HTCFG_I2CM_CH1
/*********************************************************************************************************//**
 * @brief This function handles I2C interrupt.
 * @retval None
 ************************************************************************************************************/
void I2CM_CH1_IRQHandler(void)
{
  I2CMaster_IRQHandler(I2C_MASTER_CH1);
}
#endif

#ifdef HTCFG_I2CM_CH2
/*********************************************************************************************************//**
 * @brief   This function handles I2C interrupt.
 * @retval  None
 ************************************************************************************************************/
void I2CM_CH2_IRQHandler(void)
{
  I2CMaster_IRQHandler(I2C_MASTER_CH2);
}
#endif
#endif

#ifdef HTCFG_I2CM_CH3
/*********************************************************************************************************//**
 * @brief   This function handles I2C interrupt.
 * @retval  None
 ************************************************************************************************************/
void I2CM_CH3_IRQHandler(void)
{
  I2CMaster_IRQHandler(I2C_MASTER_CH3);
}
#endif

