renbers/Personal-embedded-projects-portfolio/ball-machine/HT32    Control/utilities/middleware/i2c_master.c
/*********************************************************************************************************//**
 * @brief   This function handles I2C interrupt.
 * @param  CH: I2C Channel
 * @retval  None
 ************************************************************************************************************/
void I2CMaster_IRQHandler(u32 CH)
{
  I2CMaster_StateTypeDef *pI2CMasterState = &gI2CMasterState[CH];
  u32 uResult;

  if (pI2CMasterState->pI2Cx == 0)
  {
    return;
  }

  uResult = I2C_ReadRegister(pI2CMasterState->pI2Cx, I2C_REGISTER_SR);

  /*----------------------------- Error Process ----------------------------------------------------------  */
  if (uResult & I2C_FLAG_BUSERR)
  {
    pI2CMasterState->uIsBusError = TRUE;
    I2C_ClearFlag(pI2CMasterState->pI2Cx, I2C_FLAG_BUSERR);
    
    #if FREERTOS_I2C
    Transfer_Result[CH] = FALSE;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    xSemaphoreGiveFromISR(Semphr[CH], &xHigherPriorityTaskWoken);
    portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    #endif
    return ;
  }

  #if (LIBCFG_I2C_NO_ARBLOS == 0)
  if (uResult & I2C_FLAG_ARBLOS)
  {
    pI2CMasterState->uIsBusError = TRUE;
    I2C_ClearFlag(pI2CMasterState->pI2Cx, I2C_FLAG_ARBLOS);
    I2C_ReceiveData(pI2CMasterState->pI2Cx); // Clear Rx Interrupt
    I2C_ReceiveData(pI2CMasterState->pI2Cx);
    
    #if FREERTOS_I2C
    Transfer_Result[CH] = FALSE;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    xSemaphoreGiveFromISR(Semphr[CH], &xHigherPriorityTaskWoken);
    portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    #endif
    
    return;
  }
  #endif

  if(uResult & I2C_FLAG_TOUTF)
  {
    pI2CMasterState->uIsHardwareTimeout = TRUE;
    I2C_ClearFlag(pI2CMasterState->pI2Cx, I2C_FLAG_TOUTF);

    #if FREERTOS_I2C
    Transfer_Result[CH] = FALSE;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    xSemaphoreGiveFromISR(Semphr[CH], &xHigherPriorityTaskWoken);
    portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    #endif
    return;
  }

  if (uResult == I2C_FLAG_RXNACK)
  {
    pI2CMasterState->uIsNACK = TRUE;
    I2C_ClearFlag(pI2CMasterState->pI2Cx, I2C_FLAG_RXNACK);

    #if FREERTOS_I2C
    Transfer_Result[CH] = FALSE;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    xSemaphoreGiveFromISR(Semphr[CH], &xHigherPriorityTaskWoken);
    portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    #endif
    return;
  }


  switch (uResult)
  {
    case I2C_MASTER_SEND_START:
    {
      break;
    }
    /*-----------------------------Master Receiver ---------------------------------------------------------*/
    case I2C_MASTER_RECEIVER_MODE:
    {
      /* Enable I2C ACK for receiving data                                                                  */
      if (pI2CMasterState->uRxLength > 1)
      {
        I2C_AckCmd(pI2CMasterState->pI2Cx, ENABLE);
      }
      break;
    }
    case I2C_MASTER_RX_NOT_EMPTY_NOBUSY:
    {
      if (pI2CMasterState->uRxIndex == pI2CMasterState->uRxLength - 2)
      {
        I2C_AckCmd(pI2CMasterState->pI2Cx, DISABLE);
      }
      *(pI2CMasterState->puRxBuffer + pI2CMasterState->uRxIndex) = I2C_ReceiveData(pI2CMasterState->pI2Cx);
      pI2CMasterState->uRxIndex++;
      break;
    }
    case I2C_MASTER_RX_BUFFER_FULL:
    case I2C_MASTER_RX_NOT_EMPTY:
    {
      if (pI2CMasterState->uRxIndex == pI2CMasterState->uRxLength - 2)
      {
        I2C_AckCmd(pI2CMasterState->pI2Cx, DISABLE);
      }
      /* Receive data sent from I2C                                                                         */
      *(pI2CMasterState->puRxBuffer + pI2CMasterState->uRxIndex) = I2C_ReceiveData(pI2CMasterState->pI2Cx);
      pI2CMasterState->uRxIndex++;

      if (pI2CMasterState->uRxIndex == pI2CMasterState->uRxLength)
      {
        I2C_GenerateSTOP(pI2CMasterState->pI2Cx);

        /* Clear IsBusy flag to terminate polling of I2CMaster_GetStatus                                    */
        pI2CMasterState->IsBusy = FALSE;

        if (pI2CMasterState->sDynamicOnOffI2C)
        {
          if (_I2CMaster_DynamicTimeout(CH) == I2C_MASTER_SW_TIMEOUT)
          {
            return;
          }
          I2C_Cmd(pI2CMasterState->pI2Cx, DISABLE);
        }

        #if FREERTOS_I2C
        Transfer_Result[CH] = TRUE;
        BaseType_t xHigherPriorityTaskWoken = pdFALSE;
        xSemaphoreGiveFromISR(Semphr[CH], &xHigherPriorityTaskWoken);
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
        #endif
      }
      break;
    }

    /*-----------------------------Master Transmitter ------------------------------------------------------*/
    case I2C_MASTER_TRANSMITTER_MODE:
    case I2C_MASTER_TX_EMPTY:
    {
      if (pI2CMasterState->uTxLength != 0)
      {
        I2C_SendData(pI2CMasterState->pI2Cx, *(pI2CMasterState->puTxBuffer + pI2CMasterState->uTxIndex));
        pI2CMasterState->uTxIndex++;
        pI2CMasterState->uTxLength--;
      }
      else
      {
        I2C_IntConfig(pI2CMasterState->pI2Cx, I2C_INT_TXDE, DISABLE);
        if (pI2CMasterState->Command == I2C_MASTER_CMD_WRITE)
        {
          I2C_GenerateSTOP(pI2CMasterState->pI2Cx);
          /* Clear IsBusy flag to terminate polling of I2CMaster_GetStatus                                  */
          pI2CMasterState->IsBusy = FALSE;

          if (pI2CMasterState->sDynamicOnOffI2C)
          {
            if (_I2CMaster_DynamicTimeout(CH) == I2C_MASTER_SW_TIMEOUT)
            {
              return;
            }
            I2C_Cmd(pI2CMasterState->pI2Cx, DISABLE);
          }

          #if FREERTOS_I2C
          Transfer_Result[CH] = TRUE;
          BaseType_t xHigherPriorityTaskWoken = pdFALSE;
          xSemaphoreGiveFromISR(Semphr[CH], &xHigherPriorityTaskWoken);
          portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
          #endif
        }
        else if (pI2CMasterState->Command == I2C_MASTER_CMD_WRITEREAD)
        {
          pI2CMasterState->uI2CReadWrite = I2C_MASTER_READ;
          I2C_TargetAddressConfig(pI2CMasterState->pI2Cx, pI2CMasterState->uSlaveAddress, pI2CMasterState->uI2CReadWrite);
        }
        else if (pI2CMasterState->Command == I2C_MASTER_CMD_WRITESTOPREAD)
        {
          I2C_GenerateSTOP(pI2CMasterState->pI2Cx);
          pI2CMasterState->uI2CReadWrite = I2C_MASTER_READ;
          I2C_TargetAddressConfig(pI2CMasterState->pI2Cx, pI2CMasterState->uSlaveAddress, pI2CMasterState->uI2CReadWrite);
        }
      }
      break;
    }

    /* Received NACK when Read or Write mode                                                                */
    case I2C_MASTER_RECEIVED_RXNACK:
    case I2C_MASTER_RECEIVED_TXNACK:
    {
      I2C_ClearFlag(pI2CMasterState->pI2Cx, I2C_FLAG_RXNACK);
      I2C_GenerateSTOP(pI2CMasterState->pI2Cx);

      if (pI2CMasterState->sDynamicOnOffI2C)
      {
        if (_I2CMaster_DynamicTimeout(CH) == I2C_MASTER_SW_TIMEOUT)
        {
          return;
        }
        I2C_Cmd(pI2CMasterState->pI2Cx, DISABLE);
      }
      /* Set uIsNACK flag for I2CMaster_GetStatus                                                           */
      pI2CMasterState->uIsNACK = TRUE;
      break;
    }
  }
}

