renbers/Personal-embedded-projects-portfolio/ball-machine/HT32    Control/utilities/middleware/i2c_master.c
/*********************************************************************************************************//**
 * @brief I2C timeout handler.
 * @retval None
 ************************************************************************************************************/
void I2CMaster_TimeoutHandler(void)
{
  #ifdef HTCFG_I2CM_CH0
  if (gI2CMasterState[I2C_MASTER_CH0].sTimerCount > 0)
  {
    gI2CMasterState[I2C_MASTER_CH0].sTimerCount--;
  }
  #endif
  #ifdef HTCFG_I2CM_CH1
  if (gI2CMasterState[I2C_MASTER_CH1].sTimerCount > 0)
  {
    gI2CMasterState[I2C_MASTER_CH1].sTimerCount--;
  }
  #endif
  #ifdef HTCFG_I2CM_CH2
  if (gI2CMasterState[I2C_MASTER_CH2].sTimerCount > 0)
  {
    gI2CMasterState[I2C_MASTER_CH2].sTimerCount--;
  }
  #endif
  #ifdef HTCFG_I2CM_CH3
  if (gI2CMasterState[I2C_MASTER_CH3].sTimerCount > 0)
  {
    gI2CMasterState[I2C_MASTER_CH3].sTimerCount--;
  }
  #endif
}

/*********************************************************************************************************//**
 * @brief I2C Dynamic Timeout Process.
 * @retval None
 ************************************************************************************************************/
I2CMaster_Status_Enum _I2CMaster_DynamicTimeout(u32 CH)
{
  I2CMaster_StateTypeDef *pI2CMasterState = &gI2CMasterState[CH];

  while (I2C_GetFlagStatus(pI2CMasterState->pI2Cx, I2C_FLAG_BUSBUSY) == SET)
  {
    #if (I2C_MASTER_SW_TIMEOUT_MODE == 2)
    u32 uCurrent;
    uCurrent = I2CMASTER_GETTICK();
    pI2CMasterState->sTimerCount -= DIFF_TICK(pI2CMasterState->uStart,uCurrent);
    pI2CMasterState->uStart = uCurrent;
    #endif
    
    if (pI2CMasterState->sTimerCount <= 0) // May not work if timer's interrupt priority is lower than I2C
    {
      return I2C_MASTER_SW_TIMEOUT;
    }
  }
  return I2C_MASTER_GOING;
}

#if FREERTOS_I2C

void I2CMaster_Init_FreeRTOS(u32 CH, u32 uMasterAddress, u32 uClockSpeed)
{
  taskENTER_CRITICAL();
  I2CMaster_Init(CH, uMasterAddress, uClockSpeed);
  Semphr[CH] = xSemaphoreCreateBinaryStatic(&Semphr_Buffer[CH]);
  Mutex[CH] = xSemaphoreCreateMutexStatic(&Mutex_Buffer[CH]);
  taskEXIT_CRITICAL();
}

u32 I2CMaster_Write_FreeRTOS(u32 CH, I2CMaster_Typedef *pI2CMaster, u32 Timeout)
{
  TimeOut_t Tick_Base;

  vTaskSetTimeOutState(&Tick_Base);

  if(xSemaphoreTake(Mutex[CH], Timeout) == pdFALSE)
  {
    return FALSE;
  }

  taskENTER_CRITICAL();
  I2CMaster_Write(CH, pI2CMaster);
  xSemaphoreTake(Semphr[CH], 0);
  taskEXIT_CRITICAL();

  if(xTaskCheckForTimeOut(&Tick_Base, &Timeout) != pdFALSE)
  {
    xSemaphoreGive(Mutex[CH]);
    return FALSE;
  }

  if(xSemaphoreTake(Semphr[CH], Timeout) == pdFALSE)
  {
    xSemaphoreGive(Mutex[CH]);
    return FALSE;
  }

  xSemaphoreGive(Mutex[CH]);

  return Transfer_Result[CH];
}

u32 I2CMaster_Read_FreeRTOS(u32 CH, I2CMaster_Typedef *pI2CMaster, u32 Timeout)
{
  TimeOut_t Tick_Base;

  vTaskSetTimeOutState(&Tick_Base);

  if(xSemaphoreTake(Mutex[CH], Timeout) == pdFALSE)
  {
    return FALSE;
  }

  taskENTER_CRITICAL();
  I2CMaster_Read(CH, pI2CMaster);
  xSemaphoreTake(Semphr[CH], 0);
  taskEXIT_CRITICAL();

  if(xTaskCheckForTimeOut(&Tick_Base, &Timeout) != pdFALSE )
  {
    xSemaphoreGive(Mutex[CH]);
    return FALSE;
  }

  if(xSemaphoreTake(Semphr[CH], Timeout) == pdFALSE)
  {
    xSemaphoreGive(Mutex[CH]);
    return FALSE;
  }

  xSemaphoreGive(Mutex[CH]);

  return Transfer_Result[CH];
}

u32 I2CMaster_WriteRead_FreeRTOS(u32 CH, I2CMaster_Typedef *pI2CMaster, u32 Timeout)
{
  TimeOut_t Tick_Base;

  vTaskSetTimeOutState(&Tick_Base);

  if(xSemaphoreTake(Mutex[CH], Timeout) == pdFALSE)
  {
    return FALSE;
  }

  taskENTER_CRITICAL();
  I2CMaster_WriteRead(CH, pI2CMaster);
  xSemaphoreTake(Semphr[CH], 0);
  taskEXIT_CRITICAL();

  if(xTaskCheckForTimeOut(&Tick_Base, &Timeout) != pdFALSE )
  {
    xSemaphoreGive(Mutex[CH]);
    return FALSE;
  }

  if(xSemaphoreTake(Semphr[CH], Timeout) == pdFALSE)
  {
    xSemaphoreGive(Mutex[CH]);
    return FALSE;
  }

  xSemaphoreGive(Mutex[CH]);

  return Transfer_Result[CH];
}
#endif

/* Private functions ---------------------------------------------------------------------------------------*/

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
